AccumulationRegisters/ОстаткиНаСкладе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНаСкладе</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНаЛекарства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНаЛекарства</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Лекарство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказНаСклад</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПозицииЛекарств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Лекарство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лекарства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/Уведомления/Ext/Module.bsl
// Общий модуль "Уведомления"
Функция ПроверитьНизкиеОстатки() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ОстаткиНаСкладеОстатки.Лекарство.Наименование КАК Лекарство,
        |    ОстаткиНаСкладеОстатки.КоличествоОстаток КАК Остаток
        |ИЗ
        |    РегистрНакопления.ОстаткиНаСкладе.Остатки() КАК ОстаткиНаСкладеОстатки
        |ГДЕ
        |    ОстаткиНаСкладеОстатки.КоличествоОстаток <= 30";    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат "";
    КонецЕсли;
    
    Выборка = Результат.Выбрать();
    ТекстУведомления = "Внимание! Низкие остатки на складе:" + Символы.ПС;
    Пока Выборка.Следующий() Цикл
        ТекстУведомления = ТекстУведомления + Выборка.Лекарство + ": " + Выборка.Остаток + " ед." + Символы.ПС;
    КонецЦикла;
    
    Возврат ТекстУведомления;
КонецФункции

Функция СоздатьЧерновикЗаказаНаСклад() Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ОстаткиНаСкладеОстатки.Лекарство КАК Лекарство,
        |    ОстаткиНаСкладеОстатки.КоличествоОстаток КАК Остаток
        |ИЗ
        |    РегистрНакопления.ОстаткиНаСкладе.Остатки() КАК ОстаткиНаСкладеОстатки
        |ГДЕ
        |    ОстаткиНаСкладеОстатки.КоличествоОстаток <= 30";
    
    Результат = Запрос.Выполнить();
    Если Результат.Пустой() Тогда
        Возврат Ложь;
    КонецЕсли;

    // Проверка на существующий черновик
    ЗапросПроверка = Новый Запрос;
    ЗапросПроверка.Текст = 
        "ВЫБРАТЬ ПЕРВЫЕ 1
        |    ЗаказНаСклад.Ссылка
        |ИЗ
        |    Документ.ЗаказНаСклад КАК ЗаказНаСклад
        |ГДЕ
        |    НЕ ЗаказНаСклад.Проведен
        |    И НЕ ЗаказНаСклад.ПометкаУдаления";
    Если НЕ ЗапросПроверка.Выполнить().Пустой() Тогда
        Сообщить("Уже существует незавершённый черновик заказа. Завершите его перед созданием нового.");
        Возврат Ложь;
    КонецЕсли;

    ДокументЗаказ = Документы.ЗаказНаСклад.СоздатьДокумент();
    ДокументЗаказ.Дата = ТекущаяДата();
    
    Выборка = Результат.Выбрать();
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = ДокументЗаказ.ПозицииЛекарств.Добавить();
        НоваяСтрока.Лекарство = Выборка.Лекарство;
        НоваяСтрока.Количество = 100 - Выборка.Остаток; // Целевой запас изменён с 50 на 100
        НоваяСтрока.Цена = ВернутьЦенуЛекарства(Выборка.Лекарство, ДокументЗаказ.Дата);
        НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
    КонецЦикла;
    
    ДокументЗаказ.Записать();
    Сообщить("Создан черновик заказа на склад: " + ДокументЗаказ.Ссылка);
    Возврат Истина;
КонецФункции

Функция ВернутьЦенуЛекарства(Лекарство, Дата) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ЦеныНаЛекарстваСрезПоследних.Цена КАК Цена
        |ИЗ
        |    РегистрСведений.ЦеныНаЛекарства.СрезПоследних(&Дата, Лекарство = &Лекарство) КАК ЦеныНаЛекарстваСрезПоследних";
    
    Запрос.УстановитьПараметр("Дата", Дата);
    Запрос.УстановитьПараметр("Лекарство", Лекарство);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    Если РезультатЗапроса.Пустой() Тогда
        Возврат 0;
    Иначе
        Выборка = РезультатЗапроса.Выбрать();
        Если Выборка.Следующий() Тогда
            Возврат Выборка.Цена;
        КонецЕсли;
    КонецЕсли;
    
    Возврат 0;
КонецФункции
